Revit 2027 API
WallSweepInfo.DistanceMeasuredFrom Property
 Indicates if Distance is measured from the top or bottom of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DistanceMeasuredFrom DistanceMeasuredFrom { get; set; }
Public Property DistanceMeasuredFrom As DistanceMeasuredFrom
	Get
	Set
public:
property DistanceMeasuredFrom DistanceMeasuredFrom {
	DistanceMeasuredFrom get ();
	void set (DistanceMeasuredFrom value);
}
member DistanceMeasuredFrom : DistanceMeasuredFrom with get, set
Property Value
DistanceMeasuredFrom
 If the sweep or reveal is vertical, DistanceMeasuredFrom.Base represents the start of the wall's location curve (t=0). DistanceMeasuredFrom.Top is currently not implemented for vertical sweeps and shouldn't be used when creating them.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace